Revit 2020 API
AdvancedWood.WoodRayEllipseRadiusX Property
 The property labeled "Radius (cm) along the longer axis of ray ellipse" from the "PrismWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static string WoodRayEllipseRadiusX { get; }
Visual Basic
Public Shared ReadOnly Property WoodRayEllipseRadiusX As String
	Get
Visual C++
public:
static property String^ WoodRayEllipseRadiusX {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDistance".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace